---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
BuiltInFailures..::..ComponentRepeaterSlotFailures Properties
BuiltInFailures..::..ComponentRepeaterSlotFailures Class See Also Send Feedback
---

The BuiltInFailures..::..ComponentRepeaterSlotFailures type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ComponentRepeaterSlot_InvalidFamilyOnReload | Reloaded family not appropriate for repeated component. |

# See Also

BuiltInFailures..::..ComponentRepeaterSlotFailures Class

Autodesk.Revit.DB Namespace